miniproject0/case5/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
   
    wallL
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }   
   
    wallR
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    
    wallExpansion
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    
    twoD
    {
        type            empty;
    }
}


// ************************************************************************* //
