miniproject0/case5/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0 0 0)     //0
    (4 0 0)     //1
    (16 0 0)     //2
    (16 1 0)     //3
    (0 1 0)   //4
    (0 0 0.1)   //5
    (4 0 0.1)   //6
    (16 0 0.1)   //7
    (16 1 0.1)    //8
    (0 1 0.1)   //9
    (12 -1 0)    //10
    (16 -1 0)  //11
    (12 -1 0.1) //12
    (16 -1 0.1)  //13
    (12 0 0)    //14
    (12 0 0.1)  //15
);

blocks
(
    hex (0 2 3 4 5 7 8 9) blockL (400 25 1) simpleGrading 
    (
        1
        (
            (0.25 0.25 3)
            (0.5 0.5 1)
            (0.25 0.25 0.3333)
        )
        1
    )   //b0
    hex (10 10 14 1 12 12 15 6) rampblock (200 25 1) simpleGrading
    (
        1
        (
            (0.25 0.25 3)
            (0.75 0.75 1)
        )
        1
    )   //b1
    hex (10 11 2 14 12 13 7 15) aftexpansion2 (100 25 1) simpleGrading
    (
        1
        (
            (0.25 0.25 3)
            (0.75 0.75 1)
        )
        1
    )   //b2
);

boundary
(
    wallL
    {
        type wall;
        faces
        (
            (3 4 9 8)   //b0
        );
    }
    wallR
    {
        type wall;
        faces
        (
            (1 6 5 0)   //b0
            (11 13 12 10) //b2
        );
    }
    wallExpansion
    {
        type wall;
        faces
        (
            (1 10 12 6) //b1
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 5 9 4)   //b0
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 3 8 7)    //b0
            (11 2 7 13)     //b2
        );
    }
    twoD
    {
        type empty;
        faces
        (
            (5 7 8 9)   //b0
            (3 2 0 4)   //b0
            (12 12 15 6) //b1
            (14 10 10 1) //b1
            (12 13 7 15) //b2
            (2 11 10 14)  //b2
        );
    }
);


// ************************************************************************* //
